html/apue/standard.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Unix标准和实现</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="basic.html"> UP </a>
 |
 <a accesskey="H" href="apue.html"> HOME </a>
</div><div id="content">
<h1 class="title">Unix标准和实现</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">标准</a>
<ul>
<li><a href="#sec-1-1">ANSI C</a></li>
<li><a href="#sec-1-2">IEEE POSIX</a></li>
<li><a href="#sec-1-3">SUS和X/Open</a></li>
<li><a href="#sec-1-4">FIPS</a></li>
</ul>
</li>
<li><a href="#sec-2">实现</a></li>
<li><a href="#sec-3">限制</a>
<ul>
<li><a href="#sec-3-1">ANSI C限制</a></li>
<li><a href="#sec-3-2">POSIX</a></li>
<li><a href="#sec-3-3">XSI</a></li>
<li><a href="#sec-3-4">不确定的运行时限制</a></li>
<li><a href="#sec-3-5">动态获取限量值</a>
<ul>
<li><a href="#sec-3-5-1">返回值</a></li>
</ul>
</li>
<li><a href="#sec-3-6">功能测试宏</a>
<ul>
<li><a href="#sec-3-6-1">系统标准测试宏</a></li>
<li><a href="#sec-3-6-2">C语言标准测试宏</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-4">基本系统数据类型</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">标准</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">ANSI C</h3>
<div class="outline-text-3" id="text-1-1">
<p>
1989年后期，C程序设计语言的ANSI标准X3.159-1989得到批准。此标准已被采用为国际标准 ISO/IEC 9899:1990。ANSI是美国国家标准学会，它是由制造商和用户组成的非赢利性组织
</p>

<p>
ANSI C标准的意图是提供C程序的可移植性，使其能适合于大量不同的操作系统，而不只是UNIX。此标准不仅定义了C程序设计语言的语法和语义，也定义了其标准库
</p>

<p>
内核本身通常没有C库函数接口，如Linux的内核
</p>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">IEEE POSIX</h3>
<div class="outline-text-3" id="text-1-2">
<p>
POSIX 的目的是标准化各类Unix系统接口，以提高它们的应用程序在源代码级上的可移植性
</p>

<p>
POSIX定义了遵循它的操作系统必需提供的操作系统服务接口，而不是实现，所以并不区分系统调用和库函数。所有在标准中的例程都被称为函数
</p>

<p>
POSIX.1 本身没有专门定义超级用户的概念，但对一些操作要求区分操作权限
</p>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">SUS和X/Open</h3>
<div class="outline-text-3" id="text-1-3">
<p>
由UNIX®商标的拥有者Open Group发布，是POSIX.1 的一个扩展超集，Open Group的前身即为X/Open;
</p>

<p>
SUS的全集称为XSI，一个Unix­like系统在拿到UNIX®商标之前，需要保证遵循XSI并服从SUS的强制要求。SUS的最新标准为SUS v3，发布于2004年，并经过了ISO的标准化。主要内容分为4个部分：基本定义、系统接口、Shell和实用程序以及基本理论
</p>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">FIPS</h3>
<div class="outline-text-3" id="text-1-4">
<p>
联邦信息处理标准，实际上它只是一个更加严格的POSIX.1标准
</p>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">实现</h2>
<div class="outline-text-2" id="text-2">
<p>
各种不同Unix的实现都宣称依从POSIX，但又各自实现了自己的特性
</p>
<ul class="org-ul">
<li>SVR4
</li>
<li>4.3+BSD
</li>
<li>Linux
</li>
<li>FreeBSD
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">限制</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>编译时间选择项：比如该系统是否支持作业控制
</li>
<li>编译时间限制：比如短整型的最大值是什么
</li>
<li>运行时间限制：比如文件名的最大字符数为多少
</li>
</ul>

<p>
编译时间选择项和限制可在头文件中定义，而运行时间限制要求进程调用函数去获得限制的常量值。此外和文件系统有关的限制，比如文件名的最大字符数又和具体文件系统有关。
</p>

<p>
事实上可以分成以下三类
</p>
<ol class="org-ol">
<li>编辑时间选择项及限制(头文件)
</li>
<li>不与文件或目录相关联的运行时间限制
</li>
<li>与文件或目录相关联的运行时间限制
</li>
</ol>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">ANSI C限制</h3>
<div class="outline-text-3" id="text-3-1">
<p>
所有由ANSI C定义的限制都是编译时间限制
</p>
<ul class="org-ul">
<li>limit.h：基本数据类型的长度限制
</li>
<li>float.h：浮点数类型的长度限制
</li>
<li>stdio.h: FOPEN_MAX指的是同时打开的标准IO的最大个数，TMP_MAX临时文件名的最大字符长度
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">POSIX</h3>
<div class="outline-text-3" id="text-3-2">
<p>
POSIX.1定义了很多涉及操作系统实现限制的常数。主要分为以下几类
</p>
<ul class="org-ul">
<li>固定的最小值，如LOGIN_NAME_MAX等
</li>
<li>固定值，SSIZE_MAX
</li>
<li>在运行时可增加的值。如RE_DUP_MAX等
</li>
<li>运行时固定值，如ARG_MAX(最大函数参数长度)等
</li>
<li>路径名不定值，如PATH_MAX 等
</li>
</ul>

<p>
POSIX定义的值往往比实现要小，所以实际这些常量值需要通过sysconf, pathconf, fpathconf等函数获取
</p>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3">XSI</h3>
<div class="outline-text-3" id="text-3-3">
<p>
XSI也定义几个限制常量，这些常量大部分和消息相关，全部都被包含在limit.h内
</p>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4">不确定的运行时限制</h3>
<div class="outline-text-3" id="text-3-4">
<p>
最大路径名字_PC_PATH_MAX与最大打开文件数_PC_OPEN_MAX等
</p>

<p>
PATH_MAX在SUS v3 之前对是否包括了路径名称末尾的 null 字符('\0')没有明确定义，为保持兼容性，通常需要考虑此字符作为路径名字的一部分
</p>
</div>
</div>

<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5">动态获取限量值</h3>
<div class="outline-text-3" id="text-3-5">
<div class="org-src-container">

<pre class="src src-C"><span style="color: #7fffd4;">#include</span> <span style="color: #ffa07a;">&lt;unistd.h&gt;</span>

<span style="color: #ff4500;">//</span><span style="color: #ff4500;">&#25152;&#26377;&#20989;&#25968;&#36820;&#22238;&#65306;&#33509;&#25104;&#21151;&#20026;&#30456;&#24212;&#24120;&#37327;&#30340;&#38480;&#21046;&#20540;&#65292;&#33509;&#20986;&#38169;&#20026;-1</span>
<span style="color: #ff4500;">//</span><span style="color: #ff4500;">name: &#24120;&#37327;&#21517;&#12288;&#20197;_SC_&#24320;&#22836;&#30340;&#24120;&#37327;&#21517;&#36866;&#29992;&#20110;sysconf&#65292; &#30456;&#23545;&#30340;&#20197;_PC_&#24320;&#22836;&#30340;&#36866;&#29992;&#20110;pathconf&#21644;fpathconf</span>
<span style="color: #98fb98;">long</span> <span style="color: #87cefa;">sysconf</span>(<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">name</span>);
<span style="color: #ff4500;">//</span><span style="color: #ff4500;">pathname: &#25991;&#20214;&#21517;</span>
<span style="color: #98fb98;">long</span> <span style="color: #87cefa;">pathconf</span>(<span style="color: #00ffff;">const</span> <span style="color: #98fb98;">char</span> *<span style="color: #eedd82;">pathname</span>, <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">name</span>);
<span style="color: #ff4500;">//</span><span style="color: #ff4500;">fileds: &#25991;&#20214;&#25551;&#36848;&#31526;</span>
<span style="color: #98fb98;">long</span> <span style="color: #87cefa;">fpathconf</span>(<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">filedes</span>, <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">name</span>);
</pre>
</div>
<ul class="org-ul">
<li>sysconf：获取取系统在运行时的资源限制，如_SC_OPEN_MAX(限制一个进程可以打开文件的最大数量)等
</li>
<li>pathconf：通过路径名获取对应限制名称name的限制值
</li>
<li>fpathconf：则通过打开的文件描述符
</li>
</ul>
</div>

<div id="outline-container-sec-3-5-1" class="outline-4">
<h4 id="sec-3-5-1">返回值</h4>
<div class="outline-text-4" id="text-3-5-1">
<p>
其中有些限制名称只在某些特殊文件里有定义，如_PC_FILESIZEBITS只能用在目录中。文件限制通常直接跟文件系统的实现相关
</p>

<ul class="org-ul">
<li>如果name不是标准中定义的常量的话，上述函数将返回-1，并置errno为EINVAL (Invalid argument)
</li>
<li>若为运行时不确定值，则只返回-1
</li>
<li>函数调用成功时返回其限制值
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6">功能测试宏</h3>
<div class="outline-text-3" id="text-3-6">
<p>
资源限制通常是与具体的系统实现相关的，为了保证可移植性，应定义功能测试宏强制程序运行时的限制符合标准
</p>
</div>

<div id="outline-container-sec-3-6-1" class="outline-4">
<h4 id="sec-3-6-1">系统标准测试宏</h4>
<div class="outline-text-4" id="text-3-6-1">
<p>
功能测试宏包括了两个常量：_POSIX_C_SOURCE与_XOPEN_SOURCE
</p>
<div class="org-src-container">

<pre class="src src-C"><span style="color: #7fffd4;">#define</span> <span style="color: #eedd82;">_POSIX_C_SOURCE</span> 200112L
<span style="color: #7fffd4;">#define</span> <span style="color: #eedd82;">_XOPEN_SOURCE</span> 600
</pre>
</div>
<p>
如果在C程序源文件中定义了这两个宏，则告诉编译器，资源限制使用POSIX及SUS的定义，而不使用当前系统具体实现中的定义
</p>
</div>
</div>

<div id="outline-container-sec-3-6-2" class="outline-4">
<h4 id="sec-3-6-2">C语言标准测试宏</h4>
<div class="outline-text-4" id="text-3-6-2">
<p>
__STDC__由符合ANSIC标准的编译程序自动定义。这样就允许编写ANSI C编译程序和非ANSI C编译器都能编译的程序
</p>
<div class="org-src-container">

<pre class="src src-C"><span style="color: #7fffd4;"># ifdef</span> __STDC__
<span style="color: #98fb98;">void</span> *<span style="color: #87cefa;">myfunc</span>(<span style="color: #00ffff;">const</span> <span style="color: #98fb98;">char</span> *, <span style="color: #98fb98;">int</span>);
<span style="color: #7fffd4;"># else</span>
<span style="color: #98fb98;">void</span> *<span style="color: #87cefa;">myfunc</span>();
<span style="color: #7fffd4;"># endif</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">基本系统数据类型</h2>
<div class="outline-text-2" id="text-4">
<p>
基本系统数据类型包括size_t、time_t、uid_t、off_t、pthread_t等。这些数据类型是不透明的，在各个具体的系统实现中通常由C的typedef语句重定义的，其原型可能是某种整型数也可能是个struct结构或者其他
</p>
<table border="1" cellspacing="0" cellpadding="6" rules="all" frame="boader">
<caption class="t-above"><span class="table-number">Table 1:</span> 基本系统数据类型</caption>

<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">类型</td>
<td class="left">说明</td>
</tr>

<tr>
<td class="left">caddr_t</td>
<td class="left">内存地址</td>
</tr>

<tr>
<td class="left">clock_t</td>
<td class="left">时钟滴答计数器(进程时间)</td>
</tr>

<tr>
<td class="left">comp_t</td>
<td class="left">压缩的时钟滴答</td>
</tr>

<tr>
<td class="left">dev_t</td>
<td class="left">设备号(主和次)</td>
</tr>

<tr>
<td class="left">fd_set</td>
<td class="left">文件描述符集</td>
</tr>

<tr>
<td class="left">fpos_t</td>
<td class="left">文件位置</td>
</tr>

<tr>
<td class="left">gid_t</td>
<td class="left">数值 组ID</td>
</tr>

<tr>
<td class="left">ino_t</td>
<td class="left">i节点编号</td>
</tr>

<tr>
<td class="left">mode_t</td>
<td class="left">文件类型，文件创建方式</td>
</tr>

<tr>
<td class="left">n1ink_t</td>
<td class="left">目录项的连接计数</td>
</tr>

<tr>
<td class="left">off_t</td>
<td class="left">文件长度和位移量(带符号的)</td>
</tr>

<tr>
<td class="left">pid_t</td>
<td class="left">进程ID和进程组ID(带符号的)</td>
</tr>

<tr>
<td class="left">ptrdiff_t</td>
<td class="left">两个指针相减的结果(带符号的)</td>
</tr>

<tr>
<td class="left">r1im_t</td>
<td class="left">资源限制</td>
</tr>

<tr>
<td class="left">sig_atomic_t</td>
<td class="left">能原子地存取的数据类型</td>
</tr>

<tr>
<td class="left">sigset_t</td>
<td class="left">信号集</td>
</tr>

<tr>
<td class="left">size_t</td>
<td class="left">对象(例如字符串)长度(不带符号的)</td>
</tr>

<tr>
<td class="left">ssize_t</td>
<td class="left">返回字节计数的函数(带符号的)</td>
</tr>

<tr>
<td class="left">time_t</td>
<td class="left">日历时间的秒计数器</td>
</tr>

<tr>
<td class="left">uid_t</td>
<td class="left">数值 用户ID</td>
</tr>

<tr>
<td class="left">wchar_t</td>
<td class="left">能表示所有不同的字符码</td>
</tr>
</tbody>
</table>
<p>
为了考虑程序的可移植性，不应直接使用其对应的C基本数据类型，而应该使用这些类型
</p>

<p>
<a href="file_io.html">Next：文件I/O</a>
</p>

<p>
<a href="basic.html">Previous：基础知识</a>
</p>

<p>
<a href="apue.html">Home：目录</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">

     <br/>
     <!-- DISQUS  -->
     <div id="disqus_thread"></div>
     <script type="text/javascript">
         /* * * CONFIGURATION VARIABLES: EDIT BEFORE PASTING INTO YOUR WEBPAGE * * */
         var disqus_shortname = 'https-klose911-github-io'; // required: replace example with your forum shortname

         /* * * DON'T EDIT BELOW THIS LINE * * */
         (function() {
             var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
             dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
             (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
         })();
     </script>
     <noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
     <a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>
<script>
  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
  ga('create', 'UA-90850421-1', 'auto');
  ga('send', 'pageview');
</script>
</div>
</body>
</html>
